#+OPTIONS: reveal_center:t reveal_control:t reveal_height:-1
#+OPTIONS: reveal_history:nil reveal_keyboard:t reveal_mathjax:nil
#+OPTIONS: reveal_overview:t reveal_progress:t
#+OPTIONS: reveal_rolling_links:nil reveal_slide_number:t
#+OPTIONS: reveal_title_slide:t reveal_width:-1
#+options: toc:nil ^:nil num:nil
#+REVEAL_MARGIN: -1
#+REVEAL_MIN_SCALE: -1
#+REVEAL_MAX_SCALE: -1
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_TRANS: default
#+REVEAL_SPEED: default
#+REVEAL_THEME: black
#+REVEAL_EXTRA_CSS: ../code_formatting.css
#+REVEAL_EXTRA_JS: 
#+REVEAL_HLEVEL: 1
#+REVEAL_TITLE_SLIDE_TEMPLATE: <h1>%t</h1> <h2>%a</h2> <h2>%e</h2> <h2>%d</h2>
#+REVEAL_TITLE_SLIDE_BACKGROUND:
#+REVEAL_TITLE_SLIDE_BACKGROUND_SIZE:
#+REVEAL_TITLE_SLIDE_BACKGROUND_REPEAT:
#+REVEAL_TITLE_SLIDE_BACKGROUND_TRANSITION:
#+REVEAL_MATHJAX_URL: http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML
#+REVEAL_SLIDE_NUMBER: t
#+REVEAL_PREAMBLE:
#+REVEAL_HEAD_PREAMBLE:
#+REVEAL_POSTAMBLE:
#+REVEAL_MULTIPLEX_ID:
#+REVEAL_MULTIPLEX_SECRET:
#+REVEAL_MULTIPLEX_URL:
#+REVEAL_MULTIPLEX_SOCKETIO_URL:
#+REVEAL_PLUGINS:

#+AUTHOR: Sebastian Hahn
#+EMAIL: 
#+TITLE: File IO

** netCDF4 example 1 - part 1
#+begin_src python :results output :exports both :tangle lecture8.py :session *python*
import netCDF4

filename = os.path.join(f_dir, 'example1.nc')

f = netCDF4.Dataset(filename, 'w', format='NETCDF4')
grp_temp = f.createGroup("temperature")
subgrp_air = grp_temp.createGroup("air")
subgrp_soil = grp_temp.createGroup("soil")

print(grp_temp.groups)
#+end_src

#+RESULTS:
#+begin_example

>>> >>> >>> >>> >>> >>> >>> >>> OrderedDict([('air', <type 'netCDF4.Group'>
group /temperature/air:
    dimensions(sizes): 
    variables(dimensions): 
    groups: 
), ('soil', <type 'netCDF4.Group'>
group /temperature/soil:
    dimensions(sizes): 
    variables(dimensions): 
    groups: 
)])
#+end_example
** netCDF4 example 1 - part 3
#+begin_src python :results output :exports both :tangle lecture8.py :session *python*
with netCDF4.Dataset(filename) as f:
    print(f.dimensions)
    print(f.groups['temperature'].groups['soil'].variables['Soil Temperature'])
#+end_src

#+RESULTS:
#+begin_example

... ... OrderedDict([(u'lat', <type 'netCDF4.Dimension'>: name = 'lat', size = 50
), (u'lon', <type 'netCDF4.Dimension'>: name = 'lon', size = 50
), (u'time', <type 'netCDF4.Dimension'> (unlimited): name = 'time', size = 0
)])
<type 'netCDF4.Variable'>
float64 Soil Temperature(lat, lon)
    unit: degree celsius
    scaling: 1
path = /temperature/soil
unlimited dimensions: 
current shape = (50, 50)
filling on, default _FillValue of 9.96920996839e+36 used
#+end_example
